---
kind: property
id: P:Autodesk.Revit.DB.BuiltInFailures.SketchFailures.TooManyElementsInSketch
source: html/4916414a-7f83-16f9-96bf-17d20349a078.htm
---
# Autodesk.Revit.DB.BuiltInFailures.SketchFailures.TooManyElementsInSketch Property

This sketch is large. Performance will improve if constructed as several independent sketches.

## Syntax (C#)
```csharp
public static FailureDefinitionId TooManyElementsInSketch { get; }
```